{
  "en": {
    "menuHome": "HOME",
    "menuAbout": "ABOUT",
    "menuProjects": "PROJECTS",
    "textHeader": "GABRIEL RAMOS",
    "miniTittleAbout": "../About",
    "presentName": "Gabriel Ramos",
    "presentRole": "Full‑Stack Developer",
    "apresentacao": "Building modern applications in the front and back‑end",
    "aboutTextOne": "I am a Computer Engineering student and full‑stack developer. I work with .NET, Node.js, Docker, SQL and NoSQL databases, Azure, Linux and TailwindCSS. I master prompt engineering and I’m evolving to master a modern front‑end framework.",
    "miniTittleOne": "../Skills",
    "mySkills": "My Skills",
    "skillsText": "My experience spans a wide range of technologies and tools. Here are some of the key skills I use in my projects:",
    "miniTittleTwo": "../Services",
    "myServices": "Services",
    "descricaoOne": "Crafting responsive, modern, and visually appealing websites tailored to enhance your online presence, engage your target audience effectively, and ensure seamless performance across all devices and browsers",
    "descricaoTwo": "Creating custom, high‑quality software solutions designed to address your specific needs, ranging from powerful desktop tools to comprehensive enterprise systems, delivering reliability and scalability for your operation",
    "descricaoThree": "API creation and integration services by developing customized APIs and seamlessly connecting them to your existing systems. I ensure secure, scalable, and efficient data exchanges, optimizing your digital ecosystem and enhancing overall functionality",
    "descricaoFour": "Developing user‑friendly and innovative mobile applications for both Android and iOS platforms, transforming your ideas into fully functional, engaging solutions that users can access anytime, anywhere on their devices",
    "descricaoFive": "Implementing automation solutions with AI by developing smart scripts and advanced tools to eliminate repetitive tasks, optimize operational efficiency, save valuable time, and significantly boost productivity across your projects",
    "descricaoSix": "Offering security implementation and automated testing services to safeguard and optimize your systems. I create tailored security measures and test scripts to ensure robust protection and performance",
    "miniTittleThree": "../Folder",
    "myProjects": "Projects",
    "sendMessage": "Send a message",
    "textMessage": "I am always open to new projects and work opportunities. If you have an idea or project in mind, please contact me",
    "footerTagline": "Building modern applications in the front and back‑end",
    "quickLinks": "Fast Links",
    "contactSection": "Contacts",
    "copyright": "© 2025 Gabriel Ramos. All rights reserved.",
    "saibaMais": "Learn more ❯",
    "titleService1": "Web Development",
    "titleService2": "Software Development",
    "titleService3": "APIs",
    "titleService4": "Mobile Apps",
    "titleService5": "Automation",
    "titleService6": "Security",
    "btnProjects": "View Projects",
    "btnFaleComigo": "Contact Me"
  },
  "pt": {
    "menuHome": "HOME",
    "menuAbout": "SOBRE",
    "menuProjects": "PROJETOS",
    "textHeader": "GABRIEL RAMOS",
    "miniTittleAbout": "../Sobre",
    "presentName": "Gabriel Ramos",
    "presentRole": "Desenvolvedor Full‑Stack",
    "apresentacao": "Construindo aplicações modernas no front e back‑end",
    "aboutTextOne": "Sou estudante de Engenharia da Computação e desenvolvedor full‑stack. Trabalho com .NET, Node.js, Docker, bancos de dados SQL e NoSQL, Azure, Linux e TailwindCSS. Domínio engenharia de prompt e estou evoluindo para dominar um framework de front‑end moderno.",
    "miniTittleOne": "../Habilidades",
    "mySkills": "Minhas Habilidades",
    "skillsText": "Minha experiência abrange uma ampla variedade de tecnologias e ferramentas. Aqui estão algumas das principais habilidades que utilizo nos meus projetos:",
    "miniTittleTwo": "../Serviços",
    "myServices": "Serviços",
    "descricaoOne": "Criação de sites responsivos, modernos e visualmente atraentes, adaptados para melhorar sua presença online, envolver seu público‑alvo de forma eficaz e garantir desempenho fluido em todos os dispositivos e navegadores",
    "descricaoTwo": "Criação de soluções de software personalizadas e de alta qualidade, projetadas para atender às suas necessidades específicas, desde ferramentas de desktop poderosas até sistemas empresariais abrangentes, proporcionando confiabilidade e escalabilidade para sua operação",
    "descricaoThree": "Serviços de criação e integração de APIs desenvolvendo APIs personalizadas e conectando‑as perfeitamente aos seus sistemas existentes. Garanto trocas de dados seguras, escaláveis e eficientes, otimizando seu ecossistema digital e aprimorando a funcionalidade geral",
    "descricaoFour": "Desenvolvimento de aplicativos móveis inovadores e fáceis de usar para plataformas Android e iOS, transformando suas ideias em soluções totalmente funcionais e envolventes que os usuários podem acessar a qualquer hora e em qualquer lugar em seus dispositivos",
    "descricaoFive": "Implementação de soluções de automação com inteligência artificial, desenvolvendo scripts inteligentes e ferramentas avançadas para eliminar tarefas repetitivas, otimizar a eficiência operacional, economizar tempo valioso e aumentar significativamente a produtividade dos seus projetos",
    "descricaoSix": "Implementação de segurança e serviços de testes automatizados para proteger e otimizar seus sistemas. Eu crio medidas de segurança personalizadas e scripts de teste para garantir proteção robusta e alto desempenho",
    "miniTittleThree": "../Portfólio",
    "myProjects": "Projetos",
    "sendMessage": "Envie uma mensagem",
    "textMessage": "Estou sempre aberto a novos projetos e oportunidades de trabalho. Se você tem uma ideia ou projeto em mente, entre em contato comigo",
    "footerTagline": "Construindo aplicações modernas no front e back‑end",
    "quickLinks": "Links Rápidos",
    "contactSection": "Contatos",
    "copyright": "© 2025 Gabriel Ramos. Todos os direitos reservados.",
    "saibaMais": "Saiba mais ❯",
    "titleService1": "Desenvolvimento Web",
    "titleService2": "Desenvolvimento de Software",
    "titleService3": "APIs",
    "titleService4": "Apps Mobile",
    "titleService5": "Automação",
    "titleService6": "Segurança",
    "btnProjects": "Ver projetos",
    "btnFaleComigo": "Fale Comigo"
  }
}
